**`commonimages/base/rhel_7_9`** terragrunt plan on `pull_request` event [#632](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:REDACTED:image-pipeline/base-rhel-7-9" -> (known after apply)
      ~ date_created                     = "2024-01-23T09:50:19.355Z" -> (known after apply)
      ~ date_last_run                    = "2024-10-01T00:00:34.713Z" -> (known after apply)
      ~ date_next_run                    = "2024-11-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2024-01-23T09:50:19.355Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:REDACTED:image-pipeline/base-rhel-7-9" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:REDACTED:image-recipe/base-rhel-7-9/0.1.2" # forces replacement -> (known after apply) # forces replacement
        name                             = "base_rhel_7_9"
      ~ platform                         = "Linux" -> (known after apply)
        tags                             = {
            "application"                     = "n/a"
            "branch"                          = "main"
            "business-unit"                   = "HMPPS"
            "image-pipeline"                  = "base_rhel_7_9"
            "image-recipe"                    = "base_rhel_7_9/0.1.2"
            "infrastructure-configuration"    = "base_rhel_7_9/0.1.2"
            "is-production"                   = "true"
            "os-version"                      = "rhel 7.9"
            "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                = "n/a"
            "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
            "stig-build-linux-medium-version" = "2024.2.3"
            "update-linux-version"            = "1.0.2"
        }
        # (6 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:REDACTED:image-recipe/base-rhel-7-9/0.1.2" -> (known after apply)
      ~ date_created     = "2024-01-23T09:50:18.412Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:REDACTED:image-recipe/base-rhel-7-9/0.1.2" -> (known after apply)
        name             = "base_rhel_7_9"
      ~ owner            = "374269020027" -> (known after apply)
      ~ parent_image     = "ami-0c2f9865057c3dfe1" -> "ami-0c1e9b4f894b82051" # forces replacement
      ~ platform         = "Linux" -> (known after apply)
        tags             = {
            "application"                     = "n/a"
            "branch"                          = "main"
            "business-unit"                   = "HMPPS"
            "image-pipeline"                  = "base_rhel_7_9"
            "image-recipe"                    = "base_rhel_7_9/0.1.2"
            "infrastructure-configuration"    = "base_rhel_7_9/0.1.2"
            "is-production"                   = "true"
            "os-version"                      = "rhel 7.9"
            "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                = "n/a"
            "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
            "stig-build-linux-medium-version" = "2024.2.3"
            "update-linux-version"            = "1.0.2"
        }
      + user_data_base64 = (known after apply)
        # (3 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:REDACTED:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:REDACTED:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```
